app/controllers/site/livro_caixas_controller.rb

  def index
    condicao = " 1=1 "
    condicao += " and livro_caixas.created_at::DATE >= '#{params[:data_inicio]}' " if params[:data_inicio].present? and !params[:data_inicio].blank?
    condicao += " and livro_caixas.created_at::DATE <= '#{params[:data_fim]}' " if params[:data_fim].present? and !params[:data_fim].blank?
    @registros_caixa = LivroCaixa.where(condicao).includes(:tipo_movimentacao).references(:tipo_movimentacao).order('livro_caixas.created_at').page(params[:page]).per(10)
---
SELECT COUNT(DISTINCT "livro_caixas"."id") FROM "livro_caixas" LEFT OUTER JOIN "tipo_movimentacaos" ON "tipo_movimentacaos"."id" = "livro_caixas"."tipo_movimentacao_id" WHERE ( 1=1 )

  def create
    @registro_caixa = LivroCaixa.new(livro_caixa_params)

    respond_to do |format|
      if @registro_caixa.save
---
INSERT INTO "livro_caixas" ("created_at", "updated_at", "descricao", "tipo_movimentacao_id", "valor_cents") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2017-11-18 17:12:00.460826"], ["updated_at", "2017-11-18 17:12:00.460826"], ["descricao", "3452345"], ["tipo_movimentacao_id", 1], ["valor_cents", 345324]]