app/views/site/livro_caixas/_form.html.erb

SELECT "tipo_movimentacaos".* FROM "tipo_movimentacaos"
---
          <%= form.label :tipo_movimentacao_id %>
          <%= form.select :tipo_movimentacao_id, options_for_select(@tipos_movimentacao.map {|tipo| [tipo.nm_movimentacao, tipo.id]}, (params[:livro_caixa] && params[:livro_caixa][:tipo_movimentacao_id] ? params[:livro_caixa][:tipo_movimentacao_id] : nil)), {:prompt => 'Selecione um tipo'}, {class: 'form-control'} %>